fixing up onboarding module
